#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <errno.h>
#include <limits.h>

#include "common.h"

#ifdef __cplusplus
extern "C"
{
#endif

/***************************************************************/
/* 函  数：str_to_uint ******************************************/
/* 说  明：字符串转uint *****************************************/
/* 参  数：str 字符串 *******************************************/
/*        转换结果保存到n **************************************/
/* 返回值：0 成功***********************************************/
/*        1 失败************************************************/
/***************************************************************/
char str_to_long(const char *str, long int *n)
{
	long int val;
	char *endptr;
	
	errno = 0;
	val = strtol(str, &endptr, 0);
	if((errno == ERANGE && (val == LONG_MAX || val == LONG_MIN))|| (errno != 0 && val == 0)) 
	{
		return 1;
	}
	if(endptr == str) 
	{
	   return 1;
	}
	*n = val;
	
	return 0;
}

/***************************************************************/
/* 函  数：timestamp_to_str *************************************/
/* 说  明：时间戳转字符串 ***************************************/
/* 参  数：timestamp 时间戳 *************************************/
/*        time_str 转换结果 ************************************/
/*        str_len  结果的最大长度 ******************************/
/* 返回值：无 **************************************************/
/***************************************************************/
void timestamp_to_str(time_t timestamp, char *time_str, int str_len)
{
	struct tm *tm_t;
	
	tm_t = localtime(&timestamp);
	strftime(time_str , str_len , "%Y-%m-%d %H:%M:%S", tm_t);

	return;
}

/***************************************************************/
/* 函  数：timestr_to_stamp *************************************/
/* 说  明：字符串转时间戳 ***************************************/
/* 参  数：str_time 时间字符串 **********************************/
/* 返回值：时间戳 **********************************************/
/***************************************************************/
time_t timestr_to_stamp(char *str_time)
{
	struct tm stm;
	time_t t;

	if(!strptime(str_time, "%Y-%m-%d %H:%M:%S", &stm))
	{
		return 0;
	}
	t = mktime(&stm);

	return t;
}


#ifdef __cplusplus
}
#endif
